# GetConduitSizeSettingsIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeSettings..::..GetConduitSizeSettingsIterator Method
ConduitSizeSettings Class See Also
---
Returns a ConduitSizeSettingIterator to the conduit size settings.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ConduitSizeSettingIterator GetConduitSizeSettingsIterator()
```

Visual Basic
---
```text
Public Function GetConduitSizeSettingsIterator As ConduitSizeSettingIterator
```

Visual C++
---
```text
public:
ConduitSizeSettingIterator^ GetConduitSizeSettingsIterator()
```

# See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace